#include "Board.hpp"

namespace {}

namespace Board {
Board::Board() { initialize(); }
void Board::initialize() {
  board.emplace_back("старт", "Старт", 0, 0, -1, 970, 730, 0, -1, "-");
  board.emplace_back("улица", "Житная ул.", 60, 2, -1, 890, 730, 0, 150,
                     "зеленый");
  board.emplace_back("казна", "Общественная казна", 0, 0, -1, 830, 730, 0, -1,
                     "-");
  board.emplace_back("улица", "ул. Нагатинская", 60, 4, -1, 770, 730, 0, 150,
                     "зеленый");
  board.emplace_back("налог", "Подоходный налог", 0, 200, -1, 705, 730, 0, -1,
                     "-");
  board.emplace_back("имущество", "Рижская ж/д", 200, 25, -1, 645, 730, 0, -1,
                     "-");
  board.emplace_back("улица", "Варшавское шоссе", 100, 6, -1, 585, 730, 0, 150,
                     "фиолетовый");
  board.emplace_back("шанс", "Шанс", 0, 0, -1, 520, 730, 0, -1, "-");
  board.emplace_back("улица", "ул. Огарева", 100, 6, -1, 460, 730, 0, 150,
                     "фиолетовый");
  board.emplace_back("улица", "ул. Первая Парковая", 120, 8, -1, 400, 730, 0,
                     150, "фиолетовый");
  board.emplace_back("тюрьма", "Тюрьма", 0, 0, -1, 300, 730, 0, -1, "-");
  board.emplace_back("улица", "ул. Полянка", 140, 10, -1, 300, 650, 0, 150,
                     "красный");
  board.emplace_back("имущество", "Электростанция", 150, 18, -1, 300, 590, 0, 0,
                     "-");
  board.emplace_back("улица", "ул. Сретенка", 140, 12, -1, 300, 525, 0, 150,
                     "красный");
  board.emplace_back("улица", "Ростовская наб.", 160, 12, -1, 300, 468, 0, 150,
                     "красный");
  board.emplace_back("имущество", "Курская ж/д", 200, 25, -1, 300, 405, 0, -1,
                     "-");
  board.emplace_back("улица", "Рязанский проспект", 180, 14, -1, 300, 345, 0,
                     150, "голубой");
  board.emplace_back("шанс", "Шанс", 0, 0, -1, 300, 280, 0, -1, "-");
  board.emplace_back("улица", "ул. Вавилова", 180, 14, -1, 300, 220, 0, 150,
                     "голубой");
  board.emplace_back("улица", "Рублевское шоссе", 200, 16, -1, 300, 160, -1,
                     150, "голубой");
  board.emplace_back("стоянка", "Бесплатная стоянка", 0, 0, -1, 300, 70, -1, -1,
                     "-");
  board.emplace_back("улица", "ул. Тверская", 220, 18, -1, 400, 70, 0, 150,
                     "коричневый");
  board.emplace_back("шанс", "Шанс", 0, 0, -1, 460, 70, 0, -1, "-");
  board.emplace_back("улица", "Пушкинская ул.", 220, 18, -1, 520, 70, 0, 150,
                     "коричневый");
  board.emplace_back("улица", "Площадь Маяковского", 240, 20, -1, 585, 70, 0,
                     150, "коричневый");
  board.emplace_back("имущество", "Казанская ж/д", 200, 25, -1, 645, 70, -1, -1,
                     "-");
  board.emplace_back("улица", "ул. Грузинский вал", 260, 22, -1, 705, 70, -1,
                     150, "розовый");
  board.emplace_back("улица", "Новинский бульвар", 260, 24, -1, 765, 70, -1,
                     150, "розовый");
  board.emplace_back("имущество", "Водоканал", 150, 18, -1, 830, 70, 0, -1,
                     "-");
  board.emplace_back("улица", "Смоленская площадь", 280, 26, -1, 890, 70, -1,
                     150, "розовый");
  board.emplace_back("тюрьма", "Отправляйся в тюрьму", 0, 0, -1, 970, 70, -1,
                     -1, "-");
  board.emplace_back("улица", "ул. Щусева", 300, 28, -1, 970, 160, 0, 150,
                     "желтый");
  board.emplace_back("улица", "Гоголевский бульвар", 300, 28, -1, 970, 220, 0,
                     150, "желтый");
  board.emplace_back("казна", "Общественная казна", 0, 0, -1, 970, 280, 0, -1,
                     "-");
  board.emplace_back("улица", "Кутузовский проспект", 320, 30, -1, 970, 345, 0,
                     150, "желтый");
  board.emplace_back("имущество", "Ленинградская ж/д", 200, 25, -1, 970, 405, 0,
                     0, "-");
  board.emplace_back("шанс", "Шанс", 0, 0, -1, 970, 465, 0, -1, "-");
  board.emplace_back("улица", "ул. Малая Бронная", 350, 32, -1, 970, 525, 0,
                     150, "салатовый");
  board.emplace_back("налог", "Сверхналог", 0, 100, -1, 970, 590, 0, -1, "-");
  board.emplace_back("улица", "ул. Арбат", 400, 34, -1, 970, 650, 0, 150,
                     "салатовый");
}
void Board::printBoard() {
  for (int i = 0; i < board.size(); ++i) {
    std::cout << board[i].getName() << ' ' << board[i].getOwnerIndex() << ' '
              << i << std::endl;
  }
}
} // namespace Board
